///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоПлануПроизводства()Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПроизводственныеРесурсы.Ресурс КАК ПроизводственныйРесурс,
		|	ПроизводственныеРесурсы.ТехнологическаяОперация КАК ТехнологическаяОперация,
		|	ПроизводственныеРесурсы.ТехнологическаяОперация.ЕдиницаИзмерения КАК ТехнологическаяОперацияЕдиницаИзмерения,
		|	СУММА(ПроизводственныеРесурсы.Количество) КАК ТехнологическаяОперацияКоличество,
		|	СУММА(ПроизводственныеРесурсы.Количество) КАК Количество,
		|	ПроизводственныеРесурсы.ВидСтадииОбработки КАК ВидСтадииОбработки,
		|	ПроизводственныеРесурсы.Спецификация,
		|	ПроизводственныеРесурсы.Спецификация.Владелец КАК Номенклатура,
		|	ПроизводственныеРесурсы.Спецификация.Владелец.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ПроизводственныеРесурсы.Время) КАК ВремяВыполнения
		|ИЗ
		|	РегистрНакопления.mega_ПроизводственныеРесурсы КАК ПроизводственныеРесурсы
		|ГДЕ
		|	ПроизводственныеРесурсы.Регистратор = &ПланПроизводства
		|	И ПроизводственныеРесурсы.ДатаРесурса = &ДатаРесурса
		|СГРУППИРОВАТЬ ПО
		|	ПроизводственныеРесурсы.Ресурс,
		|	ПроизводственныеРесурсы.ТехнологическаяОперация,
		|	ПроизводственныеРесурсы.ТехнологическаяОперация.ЕдиницаИзмерения,
		|	ПроизводственныеРесурсы.ВидСтадииОбработки,
		|	ПроизводственныеРесурсы.Спецификация,
		|	ПроизводственныеРесурсы.Спецификация.Владелец,
		|	ПроизводственныеРесурсы.Спецификация.Владелец.ЕдиницаИзмерения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроизводственныйРесурс,
		|	ВидСтадииОбработки,
		|	ТехнологическаяОперация,
		|	ПроизводственныеРесурсы.Спецификация.Владелец";
	
	Запрос.УстановитьПараметр("ДатаРесурса", ДатаСмены);
	Запрос.УстановитьПараметр("ПланПроизводства", ПланПроизводства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТехнологическиеОперации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);	
		
		НоваяСтрока.ТехнологическаяОперацияВремяВыполнения = 
			Справочники.mega_Спецификации.ПолучитьДлительностьТехнологическойОперации(
   				НоваяСтрока.Спецификация, НоваяСтрока.ВидСтадииОбработки, НоваяСтрока.ТехнологическаяОперация) * 
   					НоваяСтрока.ТехнологическаяОперацияКоличество;	
	КонецЦикла;	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    	
	Автор = Пользователи.ТекущийПользователь();
	Ответственный = Автор;
	Мастер = Автор;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли