#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПервуюНеПомеченнуюНаУдалениеСпецификацию(Номенклатура)Экспорт 
	Спецификация = Справочники.mega_Спецификации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	mega_Спецификации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.mega_Спецификации КАК mega_Спецификации
	|ГДЕ
	|	mega_Спецификации.Владелец = &Номенклатура
	|	И НЕ mega_Спецификации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	Если Выборка.Следующий() Тогда 
		
		Спецификация = Выборка.Ссылка;		
	КонецЕсли;                                
	
	Возврат Спецификация;
КонецФункции


// Получить основную спецификацию номенклатуры.
// 
// Параметры:
//  Номенклатура СправочникСсылка.Номенклатура - Номенклатура, основную спецификацию которой нужно получить
// 
// Возвращаемое значение:
//  СправочникСсылка.mega_Спецификации - СправочникСсылка.mega_Спецификации
Функция ПолучитьОсновнуюСпецификациюНоменклатуры(Номенклатура)Экспорт 
	
	ОсновнаяСпецификация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "Спецификация");
	Если ЗначениеЗаполнено(ОсновнаяСпецификация) Тогда 
		
		Возврат ОсновнаяСпецификация;
	КонецЕсли;
	
	Возврат ПолучитьПервуюНеПомеченнуюНаУдалениеСпецификацию(Номенклатура);
КонецФункции

Функция ПолучитьСтруктуруВозвратаСтадииОбработки()
	
	Структура = Новый Структура;
	Структура.Вставить("НомерСтроки", 0);
	Структура.Вставить("ВидСтадииОбработки", Справочники.mega_ВидыСтадийОбработки.ПустаяСсылка());
	Структура.Вставить("КлючСвязи", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Возврат Структура;
КонецФункции

Функция ПолучитьПервуюСтадиюОбработки(Спецификация)Экспорт	
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	
	Если Спецификация.СтадииОбработки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;	
	
	ПерваяСтрока = Спецификация.СтадииОбработки[0];
	ЗаполнитьЗначенияСвойств(Структура, ПерваяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьПоследнююСтадиюОбработки(Спецификация)Экспорт
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	
	Если Спецификация.СтадииОбработки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;	
	
	ПоследняяСтрока = Спецификация.СтадииОбработки[Спецификация.СтадииОбработки.Количество() - 1];
	ЗаполнитьЗначенияСвойств(Структура, ПоследняяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьСтадиюОбработкиПоВидуСтадииОбработки(Спецификация, ВидСтадииОбработки)Экспорт
	
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	
	Если Спецификация.СтадииОбработки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
	
	Строки = Спецификация.СтадииОбработки.НайтиСтроки(Новый Структура("ВидСтадииОбработки", ВидСтадииОбработки));
	Если Строки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
	
	НайденнаяСтрока = Строки[0];
	ЗаполнитьЗначенияСвойств(Структура, НайденнаяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьПредыдущуюСтадиюОбработки(Спецификация, ТекущаяСтадияОбработки)Экспорт
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	
	Если Спецификация.СтадииОбработки.Количество() = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
	
	Если ТекущаяСтадияОбработки.НомерСтроки <= 1 Тогда 
		
		Возврат Структура;
	КонецЕсли;
		
	ПредыдущаяСтрока = Спецификация.СтадииОбработки[(ТекущаяСтадияОбработки.НомерСтроки - 1) - 1];
	ЗаполнитьЗначенияСвойств(Структура, ПредыдущаяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьСледующуюСтадиюОбработки(Спецификация, ТекущаяСтадияОбработки)Экспорт
	Структура = ПолучитьСтруктуруВозвратаСтадииОбработки();
	КоличествоСтадийОбработки = Спецификация.СтадииОбработки.Количество();
	
	
	Если КоличествоСтадийОбработки = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
	
	Если ТекущаяСтадияОбработки.НомерСтроки = КоличествоСтадийОбработки ИЛИ 
		ТекущаяСтадияОбработки.НомерСтроки = 0 Тогда 
		
		Возврат Структура;
	КонецЕсли;
		
	СледующаяСтрока = Спецификация.СтадииОбработки[ТекущаяСтадияОбработки.НомерСтроки];
	ЗаполнитьЗначенияСвойств(Структура, СледующаяСтрока);
	Возврат Структура;
КонецФункции

Функция ПолучитьВремяПроизводстваЕдиницыСпецификации(Спецификация, Количество = 1)Экспорт
	Время = 0;
	
	Для Каждого ТекСтрокаТехнологическиеОперации Из Спецификация.ТехнологическиеОперации Цикл 
		
		Время = Время + (ТекСтрокаТехнологическиеОперации.ВремяВыполнения / Спецификация.Количество * Количество);
	КонецЦикла;
	
	Возврат Время;
КонецФункции

#КонецЕсли