
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗафиксироватьЦены(ВыборкаДетальныеЗаписи) Экспорт
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьЦеныПоставщиков(Поставщики, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныПоставщиков.Поставщик,
		|	ЦеныПоставщиков.Номенклатура,
		|	ЦеныПоставщиков.Цена
		|ИЗ
		|	РегистрСведений.mega_ЦеныПоставщиков.СрезПоследних(, Поставщик В (&Поставщики)
		|	И Номенклатура В (&Номенклатура)) КАК ЦеныПоставщиков";
	
	Запрос.УстановитьПараметр("Поставщики", Поставщики);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
