
&НаСервере
Процедура ВывестиИзображение()
	
	Если ЗначениеЗаполнено(Объект.Изображение) Тогда 
		
		Изображение = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(Объект.Изображение,
			Неопределено, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежиВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.Файлы.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Файлы.Форма.ФормаВыбора" Тогда 
		
		Объект.Изображение = ВыбранноеЗначение;		
		ВывестиИзображение();
		
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВывестиИзображение();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаРеквизитыДетали.Видимость = Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.mega_ТипыНоменклатуры.Деталь");
	Элементы.ГруппаНаименование.Видимость = Объект.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.mega_ТипыНоменклатуры.Деталь");
	Элементы.ПроизводственныйРесурс.Видимость = Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.mega_ТипыНоменклатуры.Операция");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	БылиИзменения = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда 
		
		ЕдиницаИзмерения = Справочники.mega_ЕдиницыИзмерения.НайтиСоздатьЕдиницуПоКлассификатору(Объект.Ссылка, Объект.ЕдиницаПоКлассификатору);
		Если ЗначениеЗаполнено(ЕдиницаИзмерения) И Объект.ЕдиницаИзмерения = ЕдиницаИзмерения Тогда 
			
			Объект.ЕдиницаИзмерения = ЕдиницаИзмерения;
			БылиИзменения = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.Спецификация) Тогда 
		
		Спецификация = Справочники.mega_Спецификации.ПолучитьПервуюНеПомеченнуюНаУдалениеСпецификацию(Объект.Ссылка);
		Если ЗначениеЗаполнено(Спецификация) И Объект.Спецификация <> Спецификация Тогда 
			
			Объект.Спецификация = Спецификация;
			БылиИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если БылиИзменения Тогда 
		
		Записать(ПараметрыЗаписи);
	КонецЕсли;
КонецПроцедуры
