
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВыполнитьДвижение(Регистратор, ВыборкаИзРезультатаЗапроса)Экспорт
	ВыборкаИзРезультатаЗапроса.Сбросить();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		Движение = НаборЗаписей.Добавить();						
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаИзРезультатаЗапроса);		
		Движение.Количество = Справочники.mega_ЕдиницыИзмерения.ПеревестиИзЕдиницыВЕдиницу(
			ВыборкаИзРезультатаЗапроса.Количество, ВыборкаИзРезультатаЗапроса.ЕдиницаИзмерения, ВыборкаИзРезультатаЗапроса.ЕдиницаХранения);
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
