#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюСпецификацию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок //<ИмяТаблицыФормы>

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьВыборКоличества();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	УстановитьТекущуюСпецификацию();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ПоказатьВыборКоличества();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьТекущуюСпецификацию()
	
	ТекущаяСпецификация = ПредопределенноеЗначение("Справочник.mega_Спецификации.ПустаяСсылка");
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущаяСпецификация = ТекущиеДанные.Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыборКоличества()
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения(
             "ПоказатьВыборКоличестваЗавершение",
             ЭтотОбъект);
    Число = ПолучитьКоличествоТекущейСпецификации();
	ПоказатьВводЧисла(ОписаниеОповещенияОЗавершении, Число,, 15, 3)
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоТекущейСпецификации()
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСпецификация, "Количество");		
КонецФункции

&НаКлиенте
Процедура ПоказатьВыборКоличестваЗавершение(Число, ДопоплнительныеПараметры)Экспорт
	
	Если Число <> Неопределено И Число > 0 Тогда
	
		ЗначениеВыбора = Новый Структура;
		ЗначениеВыбора.Вставить("Спецификация", ТекущаяСпецификация);
		ЗначениеВыбора.Вставить("Количество", Число);
		ОповеститьОВыборе(ЗначениеВыбора);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
