Функция ВыполнитьПриход(Регистратор, ВыборкаИзРезультатаЗапроса)Экспорт 
	
	Возврат ВыполнитьДвижение(Регистратор, ВыборкаИзРезультатаЗапроса, ВидДвиженияНакопления.Приход);
КонецФункции

Функция ВыполнитьРасход(Регистратор, ВыборкаИзРезультатаЗапроса)Экспорт 
	
	Возврат ВыполнитьДвижение(Регистратор, ВыборкаИзРезультатаЗапроса, ВидДвиженияНакопления.Расход);
КонецФункции

Функция ВыполнитьДвижение(Регистратор, ВыборкаИзРезультатаЗапроса, ВидДвижения)	
	ВыборкаИзРезультатаЗапроса.Сбросить();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		Движение = НаборЗаписей.Добавить();
		
		Движение.ВидДвижения = ВидДвижения;		
		Движение.Период = Регистратор.Дата;
		
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаИзРезультатаЗапроса);		
		Движение.Количество = Справочники.mega_ЕдиницыИзмерения.ПеревестиИзЕдиницыВЕдиницу(
			ВыборкаИзРезультатаЗапроса.Количество, ВыборкаИзРезультатаЗапроса.ЕдиницаИзмерения, ВыборкаИзРезультатаЗапроса.ЕдиницаХранения);
			
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
	Возврат Истина;
КонецФункции