#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Получить ставку НДСЧислом.
// 
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.mega_СтавкиНДС - Ставка НДС
// 
// Возвращаемое значение:
//  Число - Ставка НДС числом
Функция ПолучитьСтавкуНДСЧислом(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = БезНДС ИЛИ СтавкаНДС = НДС0 Тогда
		Возврат 0;
	ИначеЕсли СтавкаНДС = НДС10 ИЛИ СтавкаНДС = НДС10_110 Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = НДС18 ИЛИ СтавкаНДС = НДС18_118 Тогда
		Возврат 18;
	Иначе 
		Возврат 20;
	КонецЕсли;
КонецФункции

// Рассчистать сумму НДС.
// 
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.mega_СтавкиНДС - Ставка НДС (ПеречислениеСсылка.mega_СтавкиНДС)
//  Сумма - Число - Сумма (Число)
// 
// Возвращаемое значение:
//  Число - Сумма НДС
Функция РассчистатьСуммуНДС(СтавкаНДС, Сумма) Экспорт
	
	СтавкаНДСЧислом = ПолучитьСтавкуНДСЧислом(СтавкаНДС);
	Возврат Сумма * (СтавкаНДСЧислом / (100 + СтавкаНДСЧислом));
КонецФункции


// Получает ставку НДС по умолчанию.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.mega_СтавкиНДС - Ставка НДС по умолчанию (20%)
Функция ПолучитьСтавкуНДСПоУмолчанию() Экспорт
	
	Возврат НДС20;
КонецФункции

#КонецОбласти

#КонецЕсли