#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Найти номенклатуру по данным поставщика.
// 
// Параметры:
//  Наименование - Строка - Наименование
//  Поставщик - СправочникСсылка.mega_Контрагенты - Поставщик
//  Код - Строка - Код
// 
// Возвращаемое значение:
//  СправочникСсылка.mega_Номенклатура - Найти номенклатуру по данным поставщика
Функция НайтиНоменклатуруПоДаннымПоставщика(Наименование, Поставщик, Код = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураПоставщиков.Номенклатура
		|ИЗ
		|	Справочник.mega_НоменклатураПоставщиков КАК НоменклатураПоставщиков
		|ГДЕ
		|	НоменклатураПоставщиков.Код = &Код
		|	И НоменклатураПоставщиков.Наименование = &Наименование
		|	И НоменклатураПоставщиков.Поставщик = &Поставщик";
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Номенклатура;
	КонецЕсли;
	Возврат Справочники.mega_Номенклатура.ПустаяСсылка();
КонецФункции

// Получить номенклатуру поставщика.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.mega_Номенклатура -Номенклатура
//  Поставщик - СправочникСсылка.mega_Контрагенты -  Поставщик
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса -- Получить номенклатуру поставщика
Функция ПолучитьНоменклатуруПоставщика(Номенклатура, Поставщик) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НоменклатураПоставщиков.Ссылка,
		|	НоменклатураПоставщиков.Код,
		|	НоменклатураПоставщиков.Наименование
		|ИЗ
		|	Справочник.mega_НоменклатураПоставщиков КАК НоменклатураПоставщиков
		|ГДЕ
		|	НоменклатураПоставщиков.Поставщик = &Поставщик
		|	И НоменклатураПоставщиков.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли