
#Область ОбработчикиСобытийЭлементовТаблицыФормыСостав

&НаКлиенте
Процедура СоставЭлементПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Наименование", ТекущиеДанные.Наименование);
		Структура.Вставить("Элемент", ТекущиеДанные.Элемент);
		
		ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные);
		СоставЭлементПриИзмененииНаСервере(Структура);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Структура);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПриИзменении(Элемент)
	СоставПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоставЭлементПриИзмененииНаСервере(ТекущаяСтрока)
	
	ТекущаяСтрока.Наименование = Строка(ТекущаяСтрока.Элемент);
КонецПроцедуры

&НаСервере
Процедура СоставПриИзмененииНаСервере()
	
	Объект.Время = Объект.Состав.Итог("Время");
КонецПроцедуры

#КонецОбласти