
&НаКлиенте
Процедура ЕдиницаПоКлассификаторуПриИзменении(Элемент)
	
	Объект.Наименование = Строка(Объект.ЕдиницаПоКлассификатору);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиЭлементовФормы()
	
	Элементы.Вес.Заголовок = СтрШаблон("Вес, %1", Строка(ЕдиницаИзмеренияВеса));
	Элементы.Объем.Заголовок = СтрШаблон("Объем, %1", Строка(ЕдиницаИзмеренияОбъема));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕдиницаИзмеренияВеса = Константы.mega_ОсновнаяЕдиницаИзмеренияВеса.Получить();
	ЕдиницаИзмеренияОбъема = Константы.mega_ОсновнаяЕдиницаИзмеренияОбъема.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовкиЭлементовФормы();
КонецПроцедуры
