#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПоследнийКод()Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	mega_Номенклатура.Код КАК Код
	|ИЗ
	|	Справочник.mega_Номенклатура КАК mega_Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Возврат Выборка.Код;	
	КонецЦикла;
	
	Возврат "8000000";
КонецФункции

Функция СформироватьКодДетали(СтруктураПараметров)Экспорт 
	
	Возврат СтрШаблон("%1-%2-%3-%4", 
		СокрЛ(СтруктураПараметров.ВидДетали.Код), 
		СокрЛ(СтруктураПараметров.ВидМатериалаДетали.Код), 
		Формат(СтруктураПараметров.ТолщинаДетали, "ЧЦ=10; ЧДЦ=0; ЧГ=0"),
		СтруктураПараметров.Штрихкод);
КонецФункции
	
Функция СформироватьНаименованиеДетали(СтруктураПараметров)Экспорт 
	
	Возврат СтрШаблон("%1-%2-%3-%4 - %5", 
		СокрЛ(СтруктураПараметров.ВидДетали.Код), 
		СокрЛ(СтруктураПараметров.ВидМатериалаДетали.Код),
		Формат(СтруктураПараметров.ТолщинаДетали, "ЧЦ=10; ЧДЦ=0; ЧГ=0"),		
		СтруктураПараметров.Штрихкод,
		СокрЛ(СтруктураПараметров.ВидДетали.Наименование));
КонецФункции

Функция ПолучитьОсновныеПараметры(Номенклатура)Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЕдиницаИзмерения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения"));
	СтруктураВозврата.Вставить("Спецификация", Справочники.mega_Спецификации.ПолучитьОсновнуюСпецификациюНоменклатуры(Номенклатура));
	
	Возврат СтруктураВозврата;
КонецФункции

#КонецЕсли