Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда 
		
		Если ЭтоНовый()Тогда 
			
			ПоследнийКод = Справочники.mega_Номенклатура.ПолучитьПоследнийКод();
			КодДляШтрихкода = Формат(Число(ПоследнийКод) + 1, "ЧЦ=7; ЧДЦ=0; ЧГ=0");
		Иначе 
			
			КодДляШтрихкода = ЭтотОбъект.Код;
		КонецЕсли;
		
		
		Штрихкод = КодДляШтрихкода + mega_Штрихкодирование.КонтрольныйСимволEAN(КодДляШтрихкода, 8);
		
		Если ЭтотОбъект.ТипНоменклатуры = Перечисления.mega_ТипыНоменклатуры.Деталь Тогда
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("ВидДетали", ЭтотОбъект.ВидДетали);
			СтруктураПараметров.Вставить("ВидМатериалаДетали", ЭтотОбъект.ВидМатериалаДетали);
			СтруктураПараметров.Вставить("ТолщинаДетали", ЭтотОбъект.ТолщинаДетали);
			СтруктураПараметров.Вставить("Штрихкод", Штрихкод);
			ЭтотОбъект.КодДетали = Справочники.mega_Номенклатура.СформироватьКодДетали(СтруктураПараметров);
			ЭтотОбъект.Наименование = Справочники.mega_Номенклатура.СформироватьНаименованиеДетали(СтруктураПараметров);
			
		Иначе
			
			ЭтотОбъект.ВидДетали = Неопределено;
			ЭтотОбъект.ВидМатериалаДетали = Неопределено;
			ЭтотОбъект.КодДетали = "";
			ЭтотОбъект.ТолщинаДетали = 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Префикс = "8";
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЕдиницаИзмерения = Неопределено;
		
	Комментарий = "";
	НаименованиеПолное = "";
	Описание = ""; 
КонецПроцедуры
