///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СтарыеЗначения; // см. СтарыеЗначения

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда 
		
		Если ЭтоНовый()Тогда 
			
			ПоследнийКод = Справочники.mega_Номенклатура.ПолучитьПоследнийКод();
			КодДляШтрихкода = Формат(Число(ПоследнийКод) + 1, "ЧЦ=7; ЧДЦ=0; ЧГ=0");
		Иначе 
			
			КодДляШтрихкода = ЭтотОбъект.Код;
		КонецЕсли;
		
		
		Штрихкод = КодДляШтрихкода + mega_Штрихкодирование.КонтрольныйСимволEAN(КодДляШтрихкода, 8);
		
		Если ЭтотОбъект.ТипНоменклатуры = Перечисления.mega_ТипыНоменклатуры.Деталь Тогда
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("ВидДетали", ЭтотОбъект.ВидДетали);
			СтруктураПараметров.Вставить("ВидМатериалаДетали", ЭтотОбъект.ВидМатериалаДетали);
			СтруктураПараметров.Вставить("ПоказательТолщины", ЭтотОбъект.ПоказательТолщины);
			СтруктураПараметров.Вставить("Штрихкод", Штрихкод);
			ЭтотОбъект.КодДетали = Справочники.mega_Номенклатура.СформироватьКодДетали(СтруктураПараметров);
			ЭтотОбъект.Наименование = Справочники.mega_Номенклатура.СформироватьНаименованиеДетали(СтруктураПараметров);
			
		Иначе
			
			ЭтотОбъект.ВидДетали = Неопределено;
			ЭтотОбъект.ВидМатериалаДетали = Неопределено;
			ЭтотОбъект.КодДетали = "";
			ЭтотОбъект.ПоказательТолщины = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	ЕдиницаИзмерения = Неопределено;
		
	Комментарий = "";
	НаименованиеПолное = "";
	Описание = ""; 	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Префикс = "8";
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции.

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
