
#Область ПрограммныйИнтерфейс

Функция ПолучитьДатуЧастями(Знач ВремяВыполнения)Экспорт
	
	ОдинДень = 24*60*60;
	ЧасовВДне = 24;
	ОдниЧас = 60*60;
	ОднаМинута = 60;
	
	ВремяВыполнения = Дата(1 , 1, 1) + ВремяВыполнения;
	КоличествоДней = Цел((НачалоДня(ВремяВыполнения) - Дата(1, 1, 1)) / ОдинДень);
	КоличествоЧасов = Цел((ВремяВыполнения - НачалоДня(ВремяВыполнения)) / ОдниЧас);
	КоличествоМинут = Цел((ВремяВыполнения - НачалоЧаса(ВремяВыполнения)) / ОднаМинута);
	КоличествоСекунд = ВремяВыполнения - НачалоМинуты(ВремяВыполнения);
	
	Структура = Новый Структура;
	Структура.Вставить("КоличествоЧасов", (КоличествоДней * ЧасовВДне) + КоличествоЧасов);
	Структура.Вставить("КоличествоМинут", КоличествоМинут);
	Структура.Вставить("КоличествоСекунд", КоличествоСекунд);
	
	Возврат Структура; 				
КонецФункции

Функция ПолучитьВремяВЧасахМинутахСекундахСтрокой(ДатаЧастями)Экспорт
		
	Возврат СтрШаблон("%1:%2:%3", ДатаЧастями.КоличествоЧасов, ДатаЧастями.КоличествоМинут, ДатаЧастями.КоличествоСекунд);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
