///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	УстановитьДатыПоУмолчанию();
	
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
	ПериодГод		 = Год(ТекущаяДатаСеанса());
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОдинЧас = 3600;
	ОдинДень = 24 * ОдинЧас;	
	Движения.mega_ПроизводственныеРесурсы.Записывать = Истина;
	
	Для Каждого ТекСтрокаПроизводственныеРесурсы Из ПроизводственныеРесурсы Цикл
		
		ТекущийДень = Дата(ПериодГод, 1, 1, 0, 0, 0);
		ПоследнийДень = НачалоДня(КонецГода(ТекущийДень));
		Пока ТекущийДень <= ПоследнийДень Цикл
			
			ВремяВЧасах = ТекСтрокаПроизводственныеРесурсы["Время" + Формат(ДеньГода(ТекущийДень), "ЧЦ=4; ЧГ=0;")];
				
			Если ВремяВЧасах > 0 Тогда				
				
				Движение = Движения.mega_ПроизводственныеРесурсы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.ДатаРесурса = ТекущийДень;
				Движение.Ресурс = ТекСтрокаПроизводственныеРесурсы.Ресурс;
				Движение.Время = ВремяВЧасах * ОдинЧас;
			КонецЕсли;
			
			ТекущийДень = ТекущийДень + ОдинДень;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УстановитьДатыПоУмолчанию();
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если КонецПериода < НачалоПериода Тогда

		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата окончания не может быть меньше даты начала.'"),
			,
			"КонецПериода",
			,
			Отказ);

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьДатыПоУмолчанию()

	НачалоПериода = НачалоГода(ТекущаяДатаСеанса());
	КонецПериода = КонецГода(ТекущаяДатаСеанса());

КонецПроцедуры


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли