///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Рассчитывает строку документа (расчет суммы ндс и суммы).
// 
// Параметры:
//  ТекущаяСтрока - Структура - Текущая строка документа
Процедура РассчитатьСтрокуДокумента(ТекущаяСтрока) Экспорт
	
	РассчитатьСуммуНДССтроки(ТекущаяСтрока);
	РассчитатьСуммуСтроки(ТекущаяСтрока);
КонецПроцедуры

// Рассчитывает сумму строки документа.
// 
// Параметры:
//  ТекущаяСтрока - Структура - Текущая строка документа
Процедура РассчитатьСуммуСтроки(ТекущаяСтрока) Экспорт
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;	
	Если ТекущаяСтрока.Свойство("СуммаВключаетНДС") Тогда
		
		Если НЕ ТекущаяСтрока.СуммаВключаетНДС Тогда
			
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Сумма + ТекущаяСтрока.СуммаНДС;
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

// Рассчитывает сумму НДС строки документа.
// 
// Параметры:
//  ТекущаяСтрока - Структура - Текущая строка документа
Процедура РассчитатьСуммуНДССтроки(ТекущаяСтрока) Экспорт
	
	Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;	
	ТекущаяСтрока.СуммаНДС = 
		Перечисления.mega_СтавкиНДС.РассчистатьСуммуНДС(ТекущаяСтрока.СтавкаНДС, Сумма); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
