Функция НайтиСоздатьЕдиницуПоКлассификатору(Владелец, ЕдиницаПоКлассификатору)Экспорт 
	
	ЕдиницаИзмерения = НайтиПоРеквизиту("ЕдиницаПоКлассификатору", ЕдиницаПоКлассификатору, , Владелец);
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда 
		
		Возврат ЕдиницаИзмерения;
	КонецЕсли;                   
	
	ЕдиницаИзмерения = СоздатьЭлемент();
	ЕдиницаИзмерения.Наименование = Строка(ЕдиницаПоКлассификатору);
	ЕдиницаИзмерения.ЕдиницаПоКлассификатору = ЕдиницаПоКлассификатору;
	ЕдиницаИзмерения.Числитель = 1;ЕдиницаИзмерения.Знаменатель = 1;
	ЕдиницаИзмерения.Длина = 1;ЕдиницаИзмерения.Ширина = 1;
	ЕдиницаИзмерения.Высота = 1;ЕдиницаИзмерения.Вес = 1;
	ЕдиницаИзмерения.Объем = 1;
	ЕдиницаИзмерения.Владелец = Владелец;                              
	
	ЕдиницаИзмерения.Записать();
	Возврат ЕдиницаИзмерения.Ссылка;
КонецФункции

Функция ПеревестиИзЕдиницыВЕдиницу(Количество, ЕдиницаКоличества, ЕдиницаДляРасчета)Экспорт 
	
	Возврат (ЕдиницаКоличества.Числитель / ЕдиницаКоличества.Знаменатель * Количество) * (ЕдиницаДляРасчета.Числитель / ЕдиницаДляРасчета.Знаменатель);
КонецФункции