///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоОстаткам(Просроченные = Ложь)Экспорт
		
	Если ЭтоНовый() Тогда
		
		ДатаСреза = ТекущаяДатаСеанса();
		ДатаДляОпеределенияПросроченности = ДатаСреза;
	Иначе
		
		ДатаСреза = Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая);
		ДатаДляОпеределенияПросроченности = ЭтотОбъект.Дата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗавкиВнутренниеОстатки.ДокументПотребности КАК ЗаявкаВнутренняя
		|ИЗ
		|	РегистрНакопления.mega_ЗавкиВнутренние.Остатки(&ДатаСреза, ВЫБОР
		|		КОГДА &Просроченные
		|			ТОГДА НАЧАЛОПЕРИОДА(ДокументПотребности.ЗакрытьПотребностьДо, ДЕНЬ) > НАЧАЛОПЕРИОДА(&ДатаДляОпеределенияПросроченности, ДЕНЬ)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ) КАК ЗавкиВнутренниеОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументПотребности";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Просроченные", Просроченные);
	Запрос.УстановитьПараметр("ДатаДляОпеределенияПросроченности", ДатаДляОпеределенияПросроченности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Состав.Добавить();
		НоваяСтрока.ЗаявкаВнутренняя = ВыборкаДетальныеЗаписи.ЗаявкаВнутренняя;
	КонецЦикла;
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    	
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗакрытьЗавкиВнутренние();
    ЗакрытьЗавкиВнутренниеКРазмещению();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗакрытьЗавкиВнутренние()
	
	ДатаСреза = Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ВидДвижения КАК ВидДвижения,
	|	&Период КАК Период,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	Остатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Остатки.ДокументПотребности КАК ДокументПотребности,
	|	Остатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.mega_ЗавкиВнутренние.Остатки(&ДатаСреза, ДокументПотребности В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Состав.ЗаявкаВнутренняя
	|		ИЗ
	|			Документ.mega_ЗакрытиеЗаявокВнутренних.Состав КАК Состав
	|		ГДЕ
	|			Состав.Ссылка = &Регистратор)) КАК Остатки";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
    		
	РегистрыНакопления.mega_ЗавкиВнутренние.ВыполнитьДвижение(ЭтотОбъект.Ссылка, Выборка);
	
КонецПроцедуры

Процедура ЗакрытьЗавкиВнутренниеКРазмещению()
	
	ДатаСреза = Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ВидДвижения КАК ВидДвижения,
	|	&Период КАК Период,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	Остатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Остатки.ДокументПотребности КАК ДокументПотребности,
	|	Остатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.mega_ЗавкиВнутренниеКРазмещению.Остатки(&ДатаСреза, ДокументПотребности В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Состав.ЗаявкаВнутренняя
	|		ИЗ
	|			Документ.mega_ЗакрытиеЗаявокВнутренних.Состав КАК Состав
	|		ГДЕ
	|			Состав.Ссылка = &Регистратор)) КАК Остатки";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
    		
	РегистрыНакопления.mega_ЗавкиВнутренниеКРазмещению.ВыполнитьДвижение(ЭтотОбъект.Ссылка, Выборка);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли