
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСпецификации();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаСпецификации Тогда
		
		ОбновитьСпецификации();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьСвязь(Команда)
	
	ТекстПредупреждения = "Ошибка соединения. Проверьте параметры соединения и повторите попытку";
	Если ОбщийМодульВызовСервера.ПроверитьСвязь() Тогда
		
		ТекстПредупреждения = "Соединение прошло успешно";
	КонецЕсли;
	
	ПоказатьПредупреждение(, ТекстПредупреждения, 5);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСпецификации(Команда)
	
	ТекстПредупреждения = "Ошибка соединения. Проверьте параметры соединения и повторите попытку";	
	Если ОбщийМодульВызовСервера.ПроверитьСвязь() Тогда
		
		Если ОбщийМодульВызовСервера.ОбновитьСпецификации() Тогда
			
			ТекстПредупреждения = "Обновление спецификаций произошло успешно";
		Иначе
			
			ТекстПредупреждения = "Ошибка обновления спецификаций";
		КонецЕсли;
	КонецЕсли;
	
	ПоказатьПредупреждение(, ТекстПредупреждения, 5);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСоединения(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаКонстант");
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкиСпецификация(Команда)
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьКнопкиСпецификации()
	
	ПодчиненныеЭлементыГруппаСпецификации = Элементы.ГруппаСпецификации.ПодчиненныеЭлементы;
	
	Пока ПодчиненныеЭлементыГруппаСпецификации.Количество() > 0 Цикл
		
		Элементы.Удалить(ПодчиненныеЭлементыГруппаСпецификации[ПодчиненныеЭлементыГруппаСпецификации.Количество() - 1]);
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура УдалитьКомандыСпецификации()
	
	МассивКомандДляУдаления = Новый Массив;		
	Для Каждого Команда Из Команды Цикл
		
		Если СтрНачинаетсяС(Команда.Имя, "Команда_") Тогда
			
			МассивКомандДляУдаления.Добавить(Команда);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого Команда Из МассивКомандДляУдаления Цикл
		
		Команды.Удалить(Команда);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпецификации()
	
	УдалитьКнопкиСпецификации();
	УдалитьКомандыСпецификации();
	
	Спецификации = РегистрыСведений.Спецификации.ПолучитьСпецификации();
	Для Каждого Спецификация Из Спецификации Цикл
		
		ИмяКоманды = "Команда_" + СтрЗаменить(Спецификация.Идентификатор, "-", "_");
		ИмяКнопки = "Кнопка_" + СтрЗаменить(Спецификация.Идентификатор, "-", "_");
		
		Команда		= Команды.Добавить(ИмяКоманды);
	    Команда.Действие	= "НажатиеКнопкиСпецификация";
	    
	
	    // Создадим кнопку и привяжем к ней команду
	    Кнопка		= Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы.ГруппаСпецификации);
	    Кнопка.Заголовок	= Спецификация.Наименование;
	    Кнопка.ИмяКоманды	= ИмяКоманды;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
