
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСпецификации();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаПользователи Тогда
		
		ОбновитьПользователи();
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаСпецификации Тогда
		
		ОбновитьСпецификации();
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаСтадииОбработки Тогда
		
		ОбновитьСтадииОбработки();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьСвязь(Команда)
	
	ТекстПредупреждения = "Ошибка соединения. Проверьте параметры соединения и повторите попытку";
	Если ОбщийМодульВызовСервера.ПроверитьСвязь() Тогда
		
		ТекстПредупреждения = "Соединение прошло успешно";
	КонецЕсли;
	
	ПоказатьПредупреждение(, ТекстПредупреждения, 5);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСпецификации(Команда)
	
	ТекстПредупреждения = "Ошибка соединения. Проверьте параметры соединения и повторите попытку";	
	Если ОбщийМодульВызовСервера.ПроверитьСвязь() Тогда
		
		Если ОбщийМодульВызовСервера.ОбновитьСпецификации() Тогда
			
			ТекстПредупреждения = "Обновление спецификаций произошло успешно";
		Иначе
			
			ТекстПредупреждения = "Ошибка обновления спецификаций";
		КонецЕсли;
	КонецЕсли;
	
	ПоказатьПредупреждение(, ТекстПредупреждения, 5);
КонецПроцедуры

&НаКлиенте
Процедура Начать(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПользователи;
	ОбновитьПользователи();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСоединения(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаКонстант");
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкиПользователи(Команда)
	
	ТекущаяСтадияОбработки = СтрЗаменить(СтрЗаменить(Команда.Имя, "КомандаПользователи_", ""), "_", "-");
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСпецификации;	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкиСпецификация(Команда)
	
	ТекущаяСпецификация = СтрЗаменить(СтрЗаменить(Команда.Имя, "КомандаСпецификации_", ""), "_", "-");	
	
	АтрибутыСпецификации = ПолучитьАтрибутыСпецификацииНаСервере();
	Элементы.НаменованиеТекущейСпецификации.Заголовок = АтрибутыСпецификации.Наименование;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСтадииОбработки;
	ОбновитьСтадииОбработки();
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопкиСтадияОбработки(Команда)
	
	ТекущаяСтадияОбработки = СтрЗаменить(СтрЗаменить(Команда.Имя, "КомандаСтадииОбработки_", ""), "_", "-");
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПользователи;
	ОбновитьПользователи();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Спецификации

&НаСервере
Функция ПолучитьАтрибутыСпецификацииНаСервере()
	
	Возврат РегистрыСведений.Спецификации.ПолучитьАтрибутыСпецификации(ТекущаяСпецификация);
КонецФункции

&НаСервере
Процедура УдалитьКнопкиСпецификации()
	
	ПодчиненныеЭлементыГруппаСпецификации = Элементы.ГруппаСпецификации.ПодчиненныеЭлементы;
	
	Пока ПодчиненныеЭлементыГруппаСпецификации.Количество() > 0 Цикл
		
		Элементы.Удалить(ПодчиненныеЭлементыГруппаСпецификации[ПодчиненныеЭлементыГруппаСпецификации.Количество() - 1]);
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура УдалитьКомандыСпецификации()
	
	МассивКомандДляУдаления = Новый Массив;		
	Для Каждого Команда Из Команды Цикл
		
		Если СтрНачинаетсяС(Команда.Имя, "КомандаСпецификации_") Тогда
			
			МассивКомандДляУдаления.Добавить(Команда);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого Команда Из МассивКомандДляУдаления Цикл
		
		Команды.Удалить(Команда);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпецификации()
	
	УдалитьКнопкиСпецификации();
	УдалитьКомандыСпецификации();
	
	Спецификации = РегистрыСведений.Спецификации.ПолучитьСпецификации();
	Для Каждого Спецификация Из Спецификации Цикл
		
		ИмяКоманды = "КомандаСпецификации_" + СтрЗаменить(Спецификация.Идентификатор, "-", "_");
		ИмяКнопки = "КнопкаСпецификации_" + СтрЗаменить(Спецификация.Идентификатор, "-", "_");
		
		Команда		= Команды.Добавить(ИмяКоманды);
	    Команда.Действие	= "НажатиеКнопкиСпецификация";
	    
	
	    // Создадим кнопку и привяжем к ней команду
	    Кнопка		= Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы.ГруппаСпецификации);
	    Кнопка.Заголовок	= Спецификация.Наименование;
	    Кнопка.ИмяКоманды	= ИмяКоманды;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СтадииОбработки

&НаСервере
Процедура УдалитьКнопкиСтадииОбработки()
	
	ПодчиненныеЭлементыГруппаСтадииОбработки = Элементы.ГруппаСтадииОбработки.ПодчиненныеЭлементы;
	
	Пока ПодчиненныеЭлементыГруппаСтадииОбработки.Количество() > 0 Цикл
		
		Элементы.Удалить(ПодчиненныеЭлементыГруппаСтадииОбработки[ПодчиненныеЭлементыГруппаСтадииОбработки.Количество() - 1]);
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура УдалитьКомандыСтадииОбработки()
	
	МассивКомандДляУдаления = Новый Массив;		
	Для Каждого Команда Из Команды Цикл
		
		Если СтрНачинаетсяС(Команда.Имя, "КомандаСтадииОбработки_") Тогда
			
			МассивКомандДляУдаления.Добавить(Команда);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого Команда Из МассивКомандДляУдаления Цикл
		
		Команды.Удалить(Команда);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтадииОбработки()
	
	УдалитьКнопкиСтадииОбработки();
	УдалитьКомандыСтадииОбработки();
	
	Если ТекущаяСпецификация <> "" Тогда
		
		СтадииОбработки = РегистрыСведений.Спецификации.ПолучитьВидыСтадийОбработкиСпецификации(ТекущаяСпецификация);
		Для Каждого СтадияОбработки Из СтадииОбработки Цикл
			
			ИмяКоманды = "КомандаСтадииОбработки_" + СтрЗаменить(СтадияОбработки.Идентификатор, "-", "_");
			ИмяКнопки = "КомандаСтадииОбработки_" + СтрЗаменить(СтадияОбработки.Идентификатор, "-", "_");
			
			Команда		= Команды.Добавить(ИмяКоманды);
		    Команда.Действие	= "НажатиеКнопкиСтадияОбработки";
		    
		
		    // Создадим кнопку и привяжем к ней команду
		    Кнопка		= Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы.ГруппаСтадииОбработки);
		    Кнопка.Заголовок	= СтадияОбработки.Наименование;
		    Кнопка.ИмяКоманды	= ИмяКоманды;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Пользователи

&НаСервере
Процедура УдалитьКнопкиПользователи()
	
	ПодчиненныеЭлементыГруппаПользователи = Элементы.ГруппаПользователи.ПодчиненныеЭлементы;
	
	Пока ПодчиненныеЭлементыГруппаПользователи.Количество() > 0 Цикл
		
		Элементы.Удалить(ПодчиненныеЭлементыГруппаПользователи[ПодчиненныеЭлементыГруппаПользователи.Количество() - 1]);
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура УдалитьКомандыПользователи()
	
	МассивКомандДляУдаления = Новый Массив;		
	Для Каждого Команда Из Команды Цикл
		
		Если СтрНачинаетсяС(Команда.Имя, "КомандаПользователи_") Тогда
			
			МассивКомандДляУдаления.Добавить(Команда);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого Команда Из МассивКомандДляУдаления Цикл
		
		Команды.Удалить(Команда);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьПользователи()
	
	УдалитьКнопкиПользователи();
	УдалитьКомандыПользователи();
	
	Пользователи = РегистрыСведений.Пользователи.ПолучитьПользователей();
	Для Каждого Пользователь Из Пользователи Цикл
			
		ИмяКоманды = "КомандаПользователи_" + СтрЗаменить(Пользователь.Идентификатор, "-", "_");
		ИмяКнопки = "КомандаПользователи_" + СтрЗаменить(Пользователь.Идентификатор, "-", "_");
			
		Команда		= Команды.Добавить(ИмяКоманды);
	    Команда.Действие	= "НажатиеКнопкиПользователи";
		    
		
	    // Создадим кнопку и привяжем к ней команду
	    Кнопка		= Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы.ГруппаПользователи);
	    Кнопка.Заголовок	= Пользователь.Наименование;
	    Кнопка.ИмяКоманды	= ИмяКоманды;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
