
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСпецификации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спецификации.specification_id КАК Идентификатор,
		|	Спецификации.specification_name КАК Наименование
		|ИЗ
		|	РегистрСведений.Спецификации КАК Спецификации";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	ТаблицаЗначений.Индексы.Добавить("Идентификатор");	
	
	Возврат ТаблицаЗначений;	
КонецФункции

Функция ПолучитьВидыСтадийОбработки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спецификации.stage_id КАК Идентификатор,
		|	Спецификации.stage_name КАК Наименование
		|ИЗ
		|	РегистрСведений.Спецификации КАК Спецификации";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	ТаблицаЗначений.Индексы.Добавить("Идентификатор");	
	
	Возврат ТаблицаЗначений;	
КонецФункции

Функция ПолучитьВидыСтадийОбработкиСпецификации(ИдентификаторСпецификации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спецификации.stage_id КАК Идентификатор,
		|	Спецификации.stage_name КАК Наименование,
		|	Спецификации.index КАК НомерСтроки,
		|	Спецификации.qnt КАК Количество
		|ИЗ
		|	РегистрСведений.Спецификации КАК Спецификации
		|ГДЕ
		|	Спецификации.specification_id = &id
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Запрос.УстановитьПараметр("id", ИдентификаторСпецификации);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();	
	
	Возврат ТаблицаЗначений;	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	Попытка
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи);
		МенеджерЗаписи.Записать();		
	Исключение
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
